Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH00/edc/PIC32CM2532JH00048.PIC
      <edc:SFRDef ltx:memberofperipheral="MCLK" edc:cname="APBDMASK" edc:nzwidth="0x20" edc:access="---------------------------nnn--" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1C" edc:_addr="0x40000820">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TC5_" edc:nzwidth="0x1" edc:desc="TC5 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TC6_" edc:nzwidth="0x1" edc:desc="TC6 APB Clock Enable"/>
            <edc:SFRFieldDef edc:cname="TC7_" edc:nzwidth="0x1" edc:desc="TC7 APB Clock Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3DC" edc:_addr="0x40000824"/>
      <edc:SFRDef ltx:memberofperipheral="RSTC" edc:cname="RCAUSE" edc:nzwidth="0x8" edc:access="-rrr-rrr" edc:impl="0x77" edc:_addr="0x40000C00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="POR" edc:nzwidth="0x1" edc:desc="Power On Reset"/>
            <edc:SFRFieldDef edc:cname="BODCORE" edc:nzwidth="0x1" edc:desc="Brown Out CORE Detector Reset"/>
            <edc:SFRFieldDef edc:cname="BODVDD" edc:nzwidth="0x1" edc:desc="Brown Out VDD Detector Reset"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EXT" edc:nzwidth="0x1" edc:desc="External Reset"/>
            <edc:SFRFieldDef edc:cname="WDT" edc:nzwidth="0x1" edc:desc="Watchdog Reset"/>
            <edc:SFRFieldDef edc:cname="SYST" edc:nzwidth="0x1" edc:desc="System Reset Request"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3FF" edc:_addr="0x40000C01"/>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="INTENCLR" edc:nzwidth="0x20" edc:access="--------------------nnnn---n--nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF13" edc:_addr="0x40001000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:nzwidth="0x1" edc:desc="XOSC Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL" edc:nzwidth="0x1" edc:desc="XOSC Clock Failure Detector Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSC48MRDY" edc:nzwidth="0x1" edc:desc="OSC48M Ready Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKR" edc:nzwidth="0x1" edc:desc="DPLL Lock Rise Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKF" edc:nzwidth="0x1" edc:desc="DPLL Lock Fall Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLLLTO" edc:nzwidth="0x1" edc:desc="DPLL Time Out Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLLLDRTO" edc:nzwidth="0x1" edc:desc="DPLL Ratio Ready Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="INTENSET" edc:nzwidth="0x20" edc:access="--------------------nnnn---n--nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF13" edc:_addr="0x40001004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:nzwidth="0x1" edc:desc="XOSC Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL" edc:nzwidth="0x1" edc:desc="XOSC Clock Failure Detector Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSC48MRDY" edc:nzwidth="0x1" edc:desc="OSC48M Ready Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKR" edc:nzwidth="0x1" edc:desc="DPLL Lock Rise Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKF" edc:nzwidth="0x1" edc:desc="DPLL Lock Fall Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLLLTO" edc:nzwidth="0x1" edc:desc="DPLL Time Out Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLLLDRTO" edc:nzwidth="0x1" edc:desc="DPLL Ratio Ready Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="INTFLAG" edc:nzwidth="0x20" edc:access="--------------------nnnn---n--nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF13" edc:_addr="0x40001008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:nzwidth="0x1" edc:desc="XOSC Ready"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL" edc:nzwidth="0x1" edc:desc="XOSC Clock Failure Detector"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSC48MRDY" edc:nzwidth="0x1" edc:desc="OSC48M Ready"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKR" edc:nzwidth="0x1" edc:desc="DPLL Lock Rise"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKF" edc:nzwidth="0x1" edc:desc="DPLL Lock Fall"/>
            <edc:SFRFieldDef edc:cname="DPLLLTO" edc:nzwidth="0x1" edc:desc="DPLL Timeout"/>
            <edc:SFRFieldDef edc:cname="DPLLLDRTO" edc:nzwidth="0x1" edc:desc="DPLL Ratio Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="STATUS" edc:nzwidth="0x20" edc:access="--------------------rrrr---r-rrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF17" edc:_addr="0x4000100C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:nzwidth="0x1" edc:desc="XOSC Ready"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL" edc:nzwidth="0x1" edc:desc="XOSC Clock Failure Detector"/>
            <edc:SFRFieldDef edc:cname="XOSCCKSW" edc:nzwidth="0x1" edc:desc="XOSC Clock Switch"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC48MRDY" edc:nzwidth="0x1" edc:desc="OSC48M Ready"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKR" edc:nzwidth="0x1" edc:desc="DPLL Lock Rise"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKF" edc:nzwidth="0x1" edc:desc="DPLL Lock Fall"/>
            <edc:SFRFieldDef edc:cname="DPLLLTO" edc:nzwidth="0x1" edc:desc="DPLL Timeout"/>
            <edc:SFRFieldDef edc:cname="DPLLLDRTO" edc:nzwidth="0x1" edc:desc="DPLL Ratio Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
