Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH00/edc/PIC32CM2532JH00048.PIC
      <edc:SFRDef ltx:memberofperipheral="TCC1" edc:cname="PER" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="11111111111111111111111111111111" edc:mclr="11111111111111111111111111111111" edc:impl="0xFFFFFF" edc:_addr="0x42002840">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="PER" edc:nzwidth="0x18" edc:desc="Period Value"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="PER" edc:nzwidth="0x14" edc:desc="Period Value"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="PER" edc:nzwidth="0x13" edc:desc="Period Value"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="PER" edc:nzwidth="0x12" edc:desc="Period Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC1" edc:cname="CC0" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x42002844">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x18" edc:desc="Channel Compare/Capture Value"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x14" edc:desc="Channel Compare/Capture Value"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x13" edc:desc="Channel Compare/Capture Value"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x12" edc:desc="Channel Compare/Capture Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC1" edc:cname="CC1" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x42002848">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x18" edc:desc="Channel Compare/Capture Value"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x14" edc:desc="Channel Compare/Capture Value"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x13" edc:desc="Channel Compare/Capture Value"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x12" edc:desc="Channel Compare/Capture Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC1" edc:cname="CC2" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x4200284C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x18" edc:desc="Channel Compare/Capture Value"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x14" edc:desc="Channel Compare/Capture Value"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x13" edc:desc="Channel Compare/Capture Value"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x12" edc:desc="Channel Compare/Capture Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC1" edc:cname="CC3" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x42002850">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x18" edc:desc="Channel Compare/Capture Value"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x14" edc:desc="Channel Compare/Capture Value"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x13" edc:desc="Channel Compare/Capture Value"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x12" edc:desc="Channel Compare/Capture Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x42002854"/>
      <edc:SFRDef ltx:memberofperipheral="TCC1" edc:cname="PATTBUF" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x42002864">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="PGEB0" edc:nzwidth="0x1" edc:desc="Pattern Generation 0 Output Enable Buffer"/>
            <edc:SFRFieldDef edc:cname="PGEB1" edc:nzwidth="0x1" edc:desc="Pattern Generation 1 Output Enable Buffer"/>
            <edc:SFRFieldDef edc:cname="PGEB2" edc:nzwidth="0x1" edc:desc="Pattern Generation 2 Output Enable Buffer"/>
            <edc:SFRFieldDef edc:cname="PGEB3" edc:nzwidth="0x1" edc:desc="Pattern Generation 3 Output Enable Buffer"/>
            <edc:SFRFieldDef edc:cname="PGEB4" edc:nzwidth="0x1" edc:desc="Pattern Generation 4 Output Enable Buffer"/>
            <edc:SFRFieldDef edc:cname="PGEB5" edc:nzwidth="0x1" edc:desc="Pattern Generation 5 Output Enable Buffer"/>
            <edc:SFRFieldDef edc:cname="PGEB6" edc:nzwidth="0x1" edc:desc="Pattern Generation 6 Output Enable Buffer"/>
            <edc:SFRFieldDef edc:cname="PGEB7" edc:nzwidth="0x1" edc:desc="Pattern Generation 7 Output Enable Buffer"/>
            <edc:SFRFieldDef edc:cname="PGVB0" edc:nzwidth="0x1" edc:desc="Pattern Generation 0 Output Value Buffer"/>
            <edc:SFRFieldDef edc:cname="PGVB1" edc:nzwidth="0x1" edc:desc="Pattern Generation 1 Output Value Buffer"/>
            <edc:SFRFieldDef edc:cname="PGVB2" edc:nzwidth="0x1" edc:desc="Pattern Generation 2 Output Value Buffer"/>
            <edc:SFRFieldDef edc:cname="PGVB3" edc:nzwidth="0x1" edc:desc="Pattern Generation 3 Output Value Buffer"/>
            <edc:SFRFieldDef edc:cname="PGVB4" edc:nzwidth="0x1" edc:desc="Pattern Generation 4 Output Value Buffer"/>
            <edc:SFRFieldDef edc:cname="PGVB5" edc:nzwidth="0x1" edc:desc="Pattern Generation 5 Output Value Buffer"/>
            <edc:SFRFieldDef edc:cname="PGVB6" edc:nzwidth="0x1" edc:desc="Pattern Generation 6 Output Value Buffer"/>
            <edc:SFRFieldDef edc:cname="PGVB7" edc:nzwidth="0x1" edc:desc="Pattern Generation 7 Output Value Buffer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x6" edc:_addr="0x42002866"/>
      <edc:SFRDef ltx:memberofperipheral="TCC1" edc:cname="PERBUF" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="11111111111111111111111111111111" edc:mclr="11111111111111111111111111111111" edc:impl="0xFFFFFF" edc:_addr="0x4200286C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="PERBUF" edc:nzwidth="0x18" edc:desc="Period Buffer Value"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="PERBUF" edc:nzwidth="0x14" edc:desc="Period Buffer Value"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="PERBUF" edc:nzwidth="0x13" edc:desc="Period Buffer Value"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="PERBUF" edc:nzwidth="0x12" edc:desc="Period Buffer Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC1" edc:cname="CCBUF0" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x42002870">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x18" edc:desc="Channel Compare/Capture Buffer Value"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x14" edc:desc="Channel Compare/Capture Buffer Value"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x13" edc:desc="Channel Compare/Capture Buffer Value"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x12" edc:desc="Channel Compare/Capture Buffer Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
